app/Controllers/Users/Orang.php

  public function index()
  {
    $curentPage = $this->request->getVar("page_orang")
      ? $this->request->getVar("page_orang")
      : 1;
    $keyword=$this->request->getVar("keyword");
    if($keyword){
      $orang = $this->orangModel->search($keyword);
    }else{
      $orang = $this->orangModel;
    }


    $data = [
      "title" => "Halaman Member",
      "orang" => $this->orangModel->paginate(4, "orang"),
---
SELECT *
FROM `orang`
 LIMIT 96, 4
SELECT COUNT(*) AS `numrows`
FROM `orang`